URLShortener/app/models/shortened_url.rb

    def random_code
        rand = SecureRandom.urlsafe_base64(16)
        until !ShortenedUrl.exists?(:short_url => rand )
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "pDOXk_9WJA5KGPqcxl2IdA"], ["LIMIT", 1]]